app/controllers/flats_controller.rb

SELECT * FROM `flats` WHERE (state IN('new', 'available')) ORDER BY priority ASC, square_meters DESC
---
  def index
    session[:page]  = params[:page]  || session[:page]  || 1
    session[:order] = params[:order] || session[:order] || "state, created_at DESC"
    @flats = FlatDecorator.decorate(current_user.flats.for_index.ordered(session[:order]).page(session[:page]))

SELECT * FROM `flats` WHERE (`flats`.`id` = 1)
---
  def show
    @flat = FlatDecorator.decorate(current_user.flats.find(params[:id]))

SELECT * FROM `flats` WHERE (`flats`.`id` = 2)
---
  def edit
    @flat = FlatDecorator.decorate(current_user.flats.find(params[:id]))

INSERT INTO `flats` (`price`, `contact_person`, `square_meters`, `available_on`, `created_at`, `title`, `updated_at`, `neighbourhood`, `image_links`, `rooms`, `url`, `priority`, `street`, `phone`, `available_until`, `state`) VALUES(585, NULL, 61, '2010-03-01', '2010-01-28 21:16:54', 'sch&ouml;ne helle Altbauwohnung', '2010-01-28 21:16:54', '<br />Prenzlauer Berg', NULL, 2, 'http://www.wg-gesucht.de/wohnungen-in-Berlin-Prenzlauer-Berg.1918681.html', NULL, 'Erich-Weinert-Stra&szlig;e 128', NULL, NULL, 'new')
---
  def create
    @flat = current_user.flats.new(params[:flat])

    if @flat.save

SELECT * FROM `flats` WHERE (`flats`.`id` = 8)
UPDATE "flats" SET "updated_at" = '2009-12-12 11:38:30', "contact_person" = '', "image_links" = 'http://img.wg-gesucht.de/media/up/2009/49/cb13487f18807470_wohnen2.sized.jpg
---
  def update
    @flat = current_user.flats.find(params[:id])

    respond_to do |format|
      if @flat.update_attributes(params[:flat])

SELECT * FROM `flats` WHERE (`flats`.`id` = 7)
DELETE FROM `flats` WHERE `id` = 7
---
  def destroy
    @flat = current_user.flats.find(params[:id])
    @flat.destroy